[Killed] BlockStatement
src/angular/services/user.service.ts:2:66
 export class UserService {
-    isUserActive(userRole: string, lastLoginDate: Date): boolean {
-        const today = new Date();
-        // Pitest will try to mutate '&&' to '||'
-        if (userRole === 'admin' && today.getFullYear() === lastLoginDate.getFullYear()) {
-            return true;
-        }
-        return false;
-    }
+    isUserActive(userRole: string, lastLoginDate: Date): boolean {}
 }
 
killedBy: UserService should be true if user is admin and logged in this year
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] ConditionalExpression
src/angular/services/user.service.ts:5:13
     isUserActive(userRole: string, lastLoginDate: Date): boolean {
         const today = new Date();
         // Pitest will try to mutate '&&' to '||'
-        if (userRole === 'admin' && today.getFullYear() === lastLoginDate.getFullYear()) {
+        if (false) {
             return true;
         }
killedBy: UserService should be true if user is admin and logged in this year
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
src/angular/services/user.service.ts:5:37
     isUserActive(userRole: string, lastLoginDate: Date): boolean {
         const today = new Date();
         // Pitest will try to mutate '&&' to '||'
-        if (userRole === 'admin' && today.getFullYear() === lastLoginDate.getFullYear()) {
+        if (userRole === 'admin' && today.getFullYear() !== lastLoginDate.getFullYear()) {
             return true;
         }
killedBy: UserService should be true if user is admin and logged in this year
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
src/angular/services/user.service.ts:6:20
         const today = new Date();
         // Pitest will try to mutate '&&' to '||'
         if (userRole === 'admin' && today.getFullYear() === lastLoginDate.getFullYear()) {
-            return true;
+            return false;
         }
         return false;
killedBy: UserService should be true if user is admin and logged in this year
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false
