[Killed] BlockStatement
src/js/utils/math.js:1:43
-function calculateTax(price, isTaxExempt) {
-    if (isTaxExempt === true) {
-        return price;
-    }
-
-    if (price > 100) {
-        return price * 1.21;
-    } else {
-        return price * 1.10;
-    }
-}
+function calculateTax(price, isTaxExempt) {}
 
 module.exports = { calculateTax };
killedBy: calculateTax should apply 21% tax for prices over 100
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 242
Received: undefined

[Killed] ConditionalExpression
src/js/utils/math.js:2:9
 function calculateTax(price, isTaxExempt) {
-    if (isTaxExempt === true) {
+    if (true) {
         return price;
     }
killedBy: calculateTax should apply 21% tax for prices over 100
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 242
Received: 200

[Killed] EqualityOperator
src/js/utils/math.js:2:9
 function calculateTax(price, isTaxExempt) {
-    if (isTaxExempt === true) {
+    if (isTaxExempt !== true) {
         return price;
     }
killedBy: calculateTax should apply 21% tax for prices over 100
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 242
Received: 200

[Killed] BlockStatement
src/js/utils/math.js:6:22
         return price;
     }
 
-    if (price > 100) {
-        return price * 1.21;
-    } else {
+    if (price > 100) {} else {
         return price * 1.10;
     }
killedBy: calculateTax should apply 21% tax for prices over 100
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 242
Received: undefined

[Killed] EqualityOperator
src/js/utils/math.js:6:9
         return price;
     }
 
-    if (price > 100) {
+    if (price <= 100) {
         return price * 1.21;
     } else {
killedBy: calculateTax should apply 21% tax for prices over 100
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 242
Received: 220.00000000000003

[Killed] ArithmeticOperator
src/js/utils/math.js:7:16
     }
 
     if (price > 100) {
-        return price * 1.21;
+        return price / 1.21;
     } else {
         return price * 1.10;
killedBy: calculateTax should apply 21% tax for prices over 100
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 242
Received: 165.28925619834712

[NoCoverage] BlockStatement
src/js/utils/math.js:8:12
 
     if (price > 100) {
         return price * 1.21;
-    } else {
-        return price * 1.10;
-    }
+    } else {}
 }
 

[NoCoverage] ArithmeticOperator
src/js/utils/math.js:9:16
     if (price > 100) {
         return price * 1.21;
     } else {
-        return price * 1.10;
+        return price / 1.10;
     }
 }
