[Killed] BlockStatement
src/react/services/paymentProcessor.ts:7:64
      * @param amount El monto del pago.
      * @param creditCard El número de tarjeta de crédito.
      */
-    processPayment(amount: number, creditCard: string): string {
-        if (amount <= 0) {
-            return "ERROR: invalid amount";
-        }
-
-        // Esta es la lógica con el fallo sutil.
-        if (amount > 1000 && creditCard.length === 16) {
-            return "SUCCESS";
-        }
-
-        return "FAIL";
-    }
+    processPayment(amount: number, creditCard: string): string {}
 }
killedBy: PaymentProcessor should return FAIL for amount under 1000
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "FAIL"
Received: undefined

[Killed] ConditionalExpression
src/react/services/paymentProcessor.ts:8:13
      * @param creditCard El número de tarjeta de crédito.
      */
     processPayment(amount: number, creditCard: string): string {
-        if (amount <= 0) {
+        if (true) {
             return "ERROR: invalid amount";
         }
killedBy: PaymentProcessor should return FAIL for amount under 1000
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "FAIL"
Received: "ERROR: invalid amount"

[Killed] EqualityOperator
src/react/services/paymentProcessor.ts:8:13
      * @param creditCard El número de tarjeta de crédito.
      */
     processPayment(amount: number, creditCard: string): string {
-        if (amount <= 0) {
+        if (amount > 0) {
             return "ERROR: invalid amount";
         }
killedBy: PaymentProcessor should return FAIL for amount under 1000
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "FAIL"
Received: "ERROR: invalid amount"

[Killed] LogicalOperator
src/react/services/paymentProcessor.ts:13:13
         }
 
         // Esta es la lógica con el fallo sutil.
-        if (amount > 1000 && creditCard.length === 16) {
+        if (amount > 1000 || creditCard.length === 16) {
             return "SUCCESS";
         }
killedBy: PaymentProcessor should return FAIL for amount under 1000
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "FAIL"
Received: "SUCCESS"

[Killed] EqualityOperator
src/react/services/paymentProcessor.ts:13:13
         }
 
         // Esta es la lógica con el fallo sutil.
-        if (amount > 1000 && creditCard.length === 16) {
+        if (amount <= 1000 && creditCard.length === 16) {
             return "SUCCESS";
         }
killedBy: PaymentProcessor should return FAIL for amount under 1000
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "FAIL"
Received: "SUCCESS"
