[Killed] BlockStatement
src/vue/components/StatusDisplay.vue:22:29
     },
   },
   computed: {
-    statusMessage(): string {
-      // El mutante cambiará '||' a '&&'.
-      if (this.isOnline || this.message.length === 0) {
-        return 'Status: Online';
-      } else {
-        return `Status: ${this.message}`;
-      }
-    },
+    statusMessage(): string {},
   },
 });
killedBy: StatusDisplay should display "Status: Online" when isOnline is true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Status: Online"
Received: ""

[Killed] BlockStatement
src/vue/components/StatusDisplay.vue:24:55
   computed: {
     statusMessage(): string {
       // El mutante cambiará '||' a '&&'.
-      if (this.isOnline || this.message.length === 0) {
-        return 'Status: Online';
-      } else {
+      if (this.isOnline || this.message.length === 0) {} else {
         return `Status: ${this.message}`;
       }
killedBy: StatusDisplay should display "Status: Online" when isOnline is true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Status: Online"
Received: ""

[Killed] LogicalOperator
src/vue/components/StatusDisplay.vue:24:11
   computed: {
     statusMessage(): string {
       // El mutante cambiará '||' a '&&'.
-      if (this.isOnline || this.message.length === 0) {
+      if (this.isOnline && this.message.length === 0) {
         return 'Status: Online';
       } else {
killedBy: StatusDisplay should display "Status: Online" when isOnline is true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Status: Online"
Received: "Status: Custom Message"

[NoCoverage] BlockStatement
src/vue/components/StatusDisplay.vue:26:14
       // El mutante cambiará '||' a '&&'.
       if (this.isOnline || this.message.length === 0) {
         return 'Status: Online';
-      } else {
-        return `Status: ${this.message}`;
-      }
+      } else {}
     },
   },
